// یک Map نمونه از BIN به نام بانک
import 'dart:async';

const Map<String, String> iranianBanksBin = {
  '603799': 'بانک ملی ایران',
  '610433': 'بانک ملت',
  '603769': 'بانک صادرات ایران',
  '627353': 'بانک تجارت',
  '589463': 'بانک رفاه کارگران',
  '628023': 'بانک مسکن',
  '589210': 'بانک سپه',
  '603770': 'بانک کشاورزی',
  '622106': 'بانک پارسیان',
  '639347': 'بانک پاسارگاد',
  '621986': 'بانک سامان',
  '639607': 'بانک سرمایه',
  '639346': 'بانک سینا',
  '502806': 'بانک شهر',
  '502938': 'بانک دی',
  '627488': 'بانک کارآفرین',
  '627381': 'بانک انصار',
  '627412': 'بانک ایران زمین',
  '636947': 'بانک حکمت ایرانیان',
  '627648': 'بانک توسعه صادرات ایران',
  '628157': 'بانک توسعه تعاون',
  '627760': 'پست بانک ایران',
  '606373': 'بانک مهر ایران',
};